new_mail = 0
if new_mail > 0:
    print('Пришло письмо, не пропусти!')
else:
    print('Никто не пишет.')
# Тут код, отсчитывающий минуту

# И снова проверим почту
if new_mail > 0:
    print('Пришло письмо, не пропусти!')
else:
    print('Никто не пишет.')
# Тут код, отсчитывающий минуту

# И снова
if new_mail > 0:
    print('Пришло письмо, не пропусти!')
else:
    print('Никто не пишет.')
# Тут код, отсчитывающий минуту

# За это время пришло письмо:
new_mail = 1
# И снова проверка
if new_mail > 0:
    print('Пришло письмо, не пропусти!')
else:
    print('Никто не пишет.')